app/views/posts/show.html.erb

SELECT COUNT(*) FROM "comments" WHERE "comments"."post_id" = ?  [["post_id", 9]]
---
<div class="comments">
  <h2><%= @post.comments.count %></h2>