app/controllers/comments_controller.rb

  def create
  	@post = Post.find(params[:post_id])
  	@comment = @post.comments.create(params[:comment].permit(:comment))
  	@comment.user_id = current_user.id
  	if @comment.save
---
SELECT  "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT 1  [["id", nil]]
INSERT INTO "comments" ("comment", "post_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["comment", "Nice Post"], ["post_id", 8], ["created_at", "2016-01-04 18:33:36.688522"], ["updated_at", "2016-01-04 18:33:36.688522"]]
UPDATE "comments" SET "user_id" = ?, "updated_at" = ? WHERE "comments"."id" = ?  [["user_id", 2], ["updated_at", "2016-01-04 18:42:13.708034"], ["id", 3]]