app/controllers/posts_controller.rb

SELECT "posts".* FROM "posts"  ORDER BY created_at DESC
---
  def index
  	@posts = Post.order("created_at DESC")

INSERT INTO "posts" ("title", "content", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["title", "First Post"], ["content", "oiausoiuaoiusa"], ["user_id", 1], ["created_at", "2016-01-04 18:05:16.370660"], ["updated_at", "2016-01-04 18:05:16.370660"]]
---
  def create
  	@post = current_user.posts.build(post_params)

  	if @post.save